Revit 2027 API
BuiltInFailures.RebarFailures.RebarArrayTooShort Property
 Rebar Set can't have coincident Bars.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarArrayTooShort { get; }
Public Shared ReadOnly Property RebarArrayTooShort As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarArrayTooShort {
	FailureDefinitionId^ get ();
}
static member RebarArrayTooShort : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace